export type Currency =
  | "uah" // Українська гривня
  | "eur" // Євро
  | "usd" // Долар США
  | "pln" // Польський злотий
  | "gbp" // Британський фунт стерлінгів
  | "afn" // Афганський афгані
  | "mkd" // Македонський денар
  | "dkk" // Данська крона
  | "thb" // Тайський бат
  | "lyd" // Лівійський динар
  | "pab" // Панамська бальбоа
  | "aed" // Дирхам ОАЕ
  | "gel" // Грузинський ларі
  | "etb" // Ефіопський бір
  | "vnd" // В'єтнамський донг
  | "try" // Турецька ліра
  | "amd" // Вірменський драм
  | "bam" // Боснійська конвертована марка
  | "krw" // Південнокорейська вона
  | "azn" // Азербайджанський манат
  | "ang" // Нідерландський антильський гульден
  | "jpy" // Японська єна
  | "ars" // Аргентинський песо
  | "czk" // Чеська крона
  | "sek" // Шведська крона
  | "nok" // Норвезька крона
  | "chf" // Швейцарський франк
  | "huf" // Угорський форинт
  | "ron" // Румунський лей
  | "ves" // Венесуельський болівар // нова назва з 2023 року
//| "veb" // Венесуельський болівар // стара назва до 2023 року
//| "hrk" // Хорватська куна
  | "cny"; // Китайський юань